{"spell":[{"name":"Borrowed Knowledge","source":"SCC","level":2,"school":"D","time":[{"number":1,"unit":"action"}],"range":{"type":"point"},"components":{"v":true,"s":true,"m":"a book worth at least 25 gp"},"classes":["Bard","Cleric","Warlock","Wizard"],"entries":[{"type":"text","entry":"You draw on knowledge from spirits of the past. Choose one skill in which you lack proficiency. For the spell's duration, you have proficiency in the chosen skill. The spell ends early if you cast it again.","id":0}]},{"name":"Kinetic Jaunt","source":"SCC","level":2,"school":"T","time":[{"number":1,"unit":"bonus"}],"range":{"type":"point"},"components":{"s":true},"duration":{"type":"timed","concentration":true,"duration":"1 minute"},"classes":["Artificer","Bard","Sorcerer","Wizard"],"entries":[{"type":"text","entry":"You magically empower your movement with dance-like steps, giving yourself the following benefits for the duration.","id":0},{"type":"list","items":[{"type":"text","entry":"Your walking speed increases by 10 feet."},{"type":"text","entry":"You don't provoke opportunity attacks."},{"type":"text","entry":"You can move through the space of another creature, and it doesn't count as {@quickref difficult terrain||3}. If you end your turn in another creature's space, you are shunted to the last unoccupied space you occupied, and you take {@damage 1d8} force damage."}],"id":1}]},{"name":"Silvery Barbs","source":"SCC","level":1,"school":"E","time":[{"number":1,"unit":"reaction","condition":"which you take when a creature you can see within 60 feet of yourself succeeds on an attack roll, an ability check, or a saving throw"}],"range":{"type":"point"},"components":{"v":true},"classes":["Bard","Sorcerer","Wizard"],"entries":[{"type":"text","entry":"You magically distract the triggering creature and turn its momentary uncertainty into encouragement for another creature. The triggering creature must reroll the {@dice d20} and use the lower roll.","id":0},{"type":"text","entry":"You can then choose a different creature you can see within range (you can choose yourself). The chosen creature has advantage on the next attack roll, ability check, or saving throw it makes within 1 minute. A creature can be empowered by only one use of this spell at a time.","id":1}]},{"name":"Vortex Warp","source":"SCC","level":2,"school":"C","time":[{"number":1,"unit":"action"}],"range":{"type":"point"},"components":{"v":true,"s":true},"classes":["Artificer","Sorcerer","Wizard"],"entries":[{"type":"text","entry":"You magically twist space around another creature you can see within range. The target must succeed on a Constitution saving throw (the target can choose to fail), or the target is teleported to an unoccupied space of your choice that you can see within range. The chosen space must be on a surface or in a liquid that can support the target without the target having to squeeze.","id":0}],"higherLevel":[{"type":"entries","name":"At Higher Levels","id":0,"children":[1]},{"type":"text","entry":"When you cast this spell using a spell slot of 3rd level or higher, the range of the spell increases by 30 feet for each slot level above 2nd.","id":1,"parentId":0}]},{"name":"Wither and Bloom","source":"SCC","level":2,"school":"N","time":[{"number":1,"unit":"action"}],"range":{"type":"point"},"components":{"v":true,"s":true,"m":"a withered vine twisted into a loop"},"classes":["Druid","Sorcerer","Wizard"],"entries":[{"type":"text","entry":"You invoke both death and life upon a 10-foot-radius sphere centered on a point within range. Each creature of your choice in that area must make a Constitution saving throw, taking {@damage 2d6} necrotic damage on a failed save, or half as much damage on a successful one. Nonmagical vegetation in that area withers.","id":0},{"type":"text","entry":"In addition, one creature of your choice in that area can spend and roll one of its unspent Hit Dice and regain a number of hit points equal to the roll plus your spellcasting ability modifier.","id":1}],"higherLevel":[{"type":"entries","name":"At Higher Levels","id":0,"children":[1]},{"type":"text","entry":"When you cast this spell using a spell slot of 3rd level or higher, the damage increases by {@scaledamage 2d6|2-9|1d6} for each slot above the 2nd, and the number of Hit Dice that can be spent and added to the healing roll increases by one for each slot above 2nd.","id":1,"parentId":0}]}]}